Revit 2018 API
DockablePaneState Properties
The DockablePaneState type exposes the following members.
Properties
Name | Description
DockPosition
 Which part of the Revit application frame the pane should dock to.
FloatingRectangle
 When %dockPosition% is Floating, this rectangle determines the size and position of the pane. Coordinates are relative to the upper-left-hand corner of the main Revit window. Note: the returned Rectangle is a copy. In order to change the pane state, you must call SetFloatingRectangle with a modified rectangle.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TabBehind
 Ignored unless %dockPosition% is Tabbed. The new pane will appear in a tab behind the specified existing pane ID.
See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace